app/controllers/akuns_controller.rb

SELECT "akuns".* FROM "akuns"
---
  def index
    @akuns = Akun.all

SELECT  "tipe_akuns".* FROM "tipe_akuns" WHERE "tipe_akuns"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_akun
      @akun = Akun.find(params[:id])