app/controllers/jurnals_controller.rb

SELECT "jurnals".* FROM "jurnals"
---
  def index
    @jurnals = Jurnal.all.paginate(page: params[:page], per_page: 30)

INSERT INTO "jurnals" ("akun_id", "deskripsi", "saldo", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["akun_id", 7], ["deskripsi", "asdas"], ["saldo", 1242], ["created_at", 2016-08-24 14:21:29 UTC], ["updated_at", 2016-08-24 14:21:29 UTC]]
---
  def create
    @jurnal = Jurnal.new(jurnal_params)

    if @jurnal.save

DELETE FROM "jurnals" WHERE "jurnals"."id" = $1  [["id", 1]]
---
  def destroy
    @jurnal.destroy

SELECT  "jurnals".* FROM "jurnals" WHERE "jurnals"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_jurnal
      @jurnal = Jurnal.find(params[:id])