app/controllers/koleksi_jurnals_controller.rb

  def index
    @koleksi_jurnals = KoleksiJurnal.all
---
SELECT "koleksi_jurnals".* FROM "koleksi_jurnals"

    def set_koleksi_jurnal
      @koleksi_jurnal = KoleksiJurnal.find(params[:id])
---
SELECT  "koleksi_jurnals".* FROM "koleksi_jurnals" WHERE "koleksi_jurnals"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]